codeigniter4-framework-5d3d4b2/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'jotaro'
 LIMIT 1
---
    public function login($username, $password){
        $user = $this->where('username', $username)->first();