Tabungin/app/Controllers/Updateprofile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '11'
---
    public function index()
    {
        $id = session()->get('currentuser')['userid'];
        $User = new UserModel();

        $data['Table'] = $User->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '11'
---
    public function Updatedata(){
        $userModel = new UserModel();
        $id = session()->get('currentuser')['userid'];
        $Dataprofile = $this->request->getPost();

        if($this->validate($userModel->Updaterules)){
            session()->set('currentuser', ['username' => $Dataprofile['username'], 'userid'   => $id]);
            $result = $userModel->updateUser($Dataprofile, $id);
            return redirect()->to('/');

        }else{
            $Error = [
                'validation' => $this->validator,
                'id' => $id,
                'Table' => $userModel->find($id),